"""ข้อมูลปีพุทธกาล 2553"""

import webbrowser
import folium
from nvd3 import multiBarChart

list_hs = {1: [[17, 17, 9], [10, 9, 0], [15.078708, 99.513578], 'โรงพยาบาลบ้านไร่'], 2: [[41, 30, 20], [8, 4, 1], [16.731054, 102.800478], 'โรงพยาบาลน้ำพอง']\
           , 3: [[18, 14, 8], [5, 5, 0], [13.798722, 100.288073], 'โรงพยาบาลพุทธมลฑล'], 4: [[17, 14, 11], [9, 7, 1], [16.376248, 104.546429], 'โรงพยาบาลนิคมคำสร้อย']\
           , 5: [[50, 45, 24], [39, 36, 0], [16.92815, 103.242925], 'โรงพยาบาลประโคนชัย'], 6: [[1, 1, 0], [0, 0, 0], [16.110352, 103.838505], 'โรงพยาบาลธวัชบรี']\
           , 7: [[7, 6, 6], [3, 3, 1], [17.334034, 103.477524], 'โรงพยาบาลส่องดาว'], 8: [[7, 3, 2], [8, 3, 1], [14.102776, 99.939159], 'โรงพยาบาลจันทรุเบกษา']\
           , 9: [[28, 21, 8], [22, 10, 1], [13.846362, 100.562252], 'โรงพยาบาลวิภาวดี'], 10: [[19, 5, 3], [11, 5, 0], [13.855967, 100.542724], 'โรงพยาบาลนนทเวช']\
           , 11: [[37, 11, 19], [21, 8, 4], [18.827182, 99.011832], 'โรงพยาบาลเชียงใหม่ราม2'], 12: [[5, 3, 3], [3, 2, 1], [17.949963, 98.690327], 'โรงพยาบาลดอยเต่า']\
           , 13: [[22, 12, 11], [10, 7, 1], [19.402457, 98.975299], 'โรงพยาบาลเชียงดาว'], 14: [[47, 36, 28], [12, 8, 1], [16.541643, 104.726904], 'โรงพยาบาลมุกดาหาร']\
           , 15: [[6, 2, 4], [6, 3, 1], [16.809878, 100.259567], 'โรงพยาบาลรวมแพทย์พิษณุโลก'], 16: [[19, 17, 11], [6, 5, 0], [9.757757, 99.085212], 'โรงพยาบาลละแม']
           , 17: [[67, 60, 18], [37, 30, 1], [8.390617, 99.971126], 'โรงพยาบาลมหาราชนครศรีธรรมราช'], 18: [[8, 2, 2], [4, 0, 0], [13.695215, 101.051644], 'โรงพยาบาลโสธรเวช304']
           , 19: [[4, 4, 2], [5, 3, 0], [14.125793, 101.007294], 'โรงพยาบาลองค์รักษ์'], 20: [[3, 2, 2], [2, 2, 0], [15.878995, 102.910406], 'โรงพยาบาลเปือยน้อย']
           , 21: [[19, 15, 7], [6, 4, 1], [13.985384, 100.612688], 'โรงพยาบาลประชาธิปัตย์'], 22: [[1, 1, 0], [6, 4, 0], [13.179034, 100.928865], 'โรงพยาบาลสมิติเวชศรีราชา']
           , 23: [[26, 23, 14], [13, 12, 0], [11.487984, 99.60103], 'โรงพยาบาลทับสะแก'], 24: [[36, 21, 16], [26, 18, 0], [14.8966, 100.39767], 'โรงพยาบาลสิงห์บุรี']
           , 26: [[16, 11, 1], [11, 7, 0], [13.8057, 100.038983], 'โรงพยาบาลสนามจันทร์']
           , 27: [[19, 15, 7], [13, 12, 2], [14.848705, 100.099093], 'โรงพยาบาลเดิมบางนางบวช'], 28: [[28, 28, 10], [19, 18, 0], [8.645874, 99.940802], 'โรงพยาบาลท่าศาลา']
           , 29: [[19, 15, 12], [2, 2, 1], [18.707521, 99.55502], 'โรงพยาบาลแจ้ห่ม'], 30: [[13, 10, 6], [5, 4, 0], [16.158901, 100.603648], 'โรงพยาบาลทับคล้อ']
           , 31: [[13, 12, 6], [4, 2, 0], [14.812302, 100.533184], 'โรงพยาบาลท่าวุ้ง'], 32: [[18, 17, 16], [11, 10, 2], [18.461935, 99.129666], 'โรงพยาบาลแม่ทา']
           , 33: [[25, 23, 15], [8, 7, 6], [18.363753, 103.651541], 'โรงพยาบาลบึงกาฬ'], 34: [[28, 20, 13], [18, 11, 0], [14.636406, 101.197686], 'โรงพยาบาลมวกเหล็ก']
           , 36: [[13, 7, 8], [4, 3, 0], [14.612835, 100.733033], 'โรงพยาบาลบ้านหมอ'], 38: [[18, 17, 9], [11, 11, 2], [14.098288, 101.777765], 'โรงพยาบาลนาดี']
           , 39: [[36, 25, 20], [13, 9, 2], [14.252344, 101.066371], 'โรงพยาบาลบ้านนา'], 40: [[18, 9, 12], [5, 5, 0], [15.025951, 103.935714], 'โรงพยาบาลสำโรงทาบ']
           , 41: [[26, 24, 15], [10, 9, 0], [16.885604, 101.23024], 'โรงพยาบาลหล่มเก่า'], 42: [[65, 53, 18], [40, 35, 1], [8.076029, 98.914822], 'โรงพยาบาลกระบี่']
           , 43: [[15, 14, 10], [7, 7, 0], [17.938802, 103.947982], 'โรงพยาบาลเซกา'], 44: [[3, 2, 3], [1, 0, 0], [15.568773, 101.993917], 'โรงพยาบาลเนินสง่า']
           , 45: [[57, 53, 41], [31, 24, 4], [19.190705, 99.877684], 'โรงพยาบาลพะเยา'], 47: [[13, 11, 8], [5, 3, 0], [17.275389, 101.158716], 'โรงพยาบาลด่านซ้าย']
           , 48: [[22, 20, 12], [14, 13, 0], [14.334772, 99.513401], 'โรงพยาบาลบ่อพลอย']
           , 49: [[8, 5, 1], [2, 1, 0], [10.502059, 99.143677], 'โรงพยาบาลธนบุรี-ชุมพร'], 50: [[12, 9, 4], [11, 9, 1], [17.055514, 99.072873], 'โรงพยาบาลบ้านตาก']
           , 51: [[29, 21, 15], [11, 6, 1], [15.209335, 102.059083], 'โรงพยาบาลโนนไทย'], 52: [[5, 3, 2], [0, 0, 0], [12.564023, 99.959453], 'โรงพยาบาลซานเปาโลหัวหิน']
           , 54: [[3, 2, 2], [0, 0, 0], [14.78776, 100.677514], 'โรงพยาบาลเมืองนารายณ์']
           , 55: [[7, 6, 2], [4, 1, 1], [14.786139, 100.292945], 'โรงพยาบาลค่ายบางระจัน'], 56: [[17, 13, 8], [4, 3, 1], [8.402172, 98.741917], 'โรงพยาบาลอ่าวลึก']
           , 57: [[15, 13, 10], [4, 4, 0], [18.185919, 103.737752], 'โรงพยาบาลศรีวิไล'], 58: [[29, 28, 24], [8, 8, 0], [19.35261, 99.509976], 'โรงพยาบาลเวียงป่าเป้า']
           , 60: [[12, 11, 10], [5, 3, 0], [19.85029, 100.145435], 'โรงพยาบาลพญาเม็งราย'], 62: [[3, 3, 2], [1, 1, 0], [15.736519, 101.773483], 'โรงพยาบาลหนองบัวระเหว']
           , 63: [[15, 12, 10], [5, 5, 0], [17.454992, 104.468754], 'โรงพยาบาลโพนสวรรค์'], 64: [[10, 8, 2], [6, 6, 0], [7.203228, 99.693903], 'โรงพยาบาลปะเหลียน']
           , 65: [[6, 0, 1], [4, 0, 0], [14.981726, 102.072392], 'โรงพยาบาลราชสีมาธนบุรี'], 66: [[4, 4, 2], [2, 2, 0], [16.046334, 103.4007], 'โรงพยาบาลแกดำ']
           , 67: [[28, 16, 14], [15, 8, 0], [13.892695, 100.509306], 'โรงพยาบาลชลประทาน'], 68: [[18, 18, 8], [5, 5, 0], [8.25725, 99.045212], 'โรงพยาบาลเขาพนม']
           , 69: [[8, 8, 8], [0, 0, 0], [17.96943, 104.043938], 'โรงพยาบาลบึงโขงหลง'], 70: [[4, 3, 3], [9, 8, 0], [13.45311, 99.886891], 'โรงพยาบาลวัดเพลง']
           , 71: [[24, 23, 19], [9, 9, 1], [16.651685, 102.379835], 'โรงพยาบาลภูเวียง'], 72: [[7, 7, 5], [4, 3, 1], [17.327134, 104.309219], 'โรงพยาบาลกุสุมาลย์']
           , 73: [[6, 6, 2], [1, 1, 0], [15.663812, 102.948967], 'โรงพยาบาลนาโพธิ์']
           , 75: [[11, 8, 8], [5, 5, 1], [17.786885, 104.088492], 'โรงพยาบาลนาทม'], 76: [[10, 2, 1], [10, 4, 0], [15.696045, 100.122586], 'โรงพยาบาลปากน้ำโพ']
           , 77: [[64, 53, 35], [15, 8, 1], [14.632046, 103.410664], 'โรงพยาบาลปราสาท'], 78: [[13, 10, 5], [4, 4, 1], [10.438882, 99.248907], 'โรงพยาบาลปากน้ำชุมพร']
           , 79: [[15, 13, 10], [1, 0, 0], [16.416282, 100.520545], 'โรงพยาบาลวังทรายพูน'], 80: [[12, 10, 8], [5, 5, 0], [18.179448, 98.611803], 'โรงพยาบาลฮอด']
           , 81: [[24, 22, 15], [11, 11, 3], [17.270706, 102.597954], 'โรงพยาบาลหนองวัวซอ'], 82: [[8, 8, 3], [1, 0, 0], [8.533076, 98.865374], 'โรงพยาบาลปลายพระยา']
           , 83: [[2, 1, 0], [2, 2, 0], [6.570547, 101.542581], 'โรงพยาบาลกระพ้อ'], 84: [[13, 7, 6], [4, 4, 1], [19.883937, 99.925331], 'โรงพยาบาลสมเด็จพระญาณสังวร']
           , 85: [[14, 12, 10], [14, 12, 1], [16.03965, 100.352228], 'โรงพยาบาลบางมูลนาก'], 86: [[28, 24, 16], [17, 15, 3], [16.530293, 104.041515], 'โรงพยาบาลกุฉินารายณ์']
           , 87: [[34, 22, 11], [30, 21, 1], [9.123518, 99.310171], 'โรงพยาบาลสุราษฎร์ธานี']
           , 89: [[22, 21, 8], [16, 11, 1], [15.068953, 100.738346], 'โรงพยาบาลโคกสำโรง'], 90: [[5, 5, 4], [4, 4, 1], [13.881683, 101.407294], 'โรงพยาบาลศรีมโหสถ']
           , 91: [[27, 25, 14], [11, 9, 1], [16.279371, 101.95497], 'โรงพยาบาลเกษตรสมบูรณ์'], 92: [[28, 24, 12], [12, 10, 0], [9.161794, 99.492931], 'โรงพยาบาลกาญจนดิษฐ์']
           , 93: [[12, 11, 8], [1, 1, 0], [18.744528, 99.221559], 'โรงพยาบาลแม่ออน'], 94: [[12, 11, 6], [7, 7, 0], [14.141203, 100.823802], 'โรงพยาบาลหนองเสือ']
           , 95: [[14, 14, 9], [5, 4, 2], [16.042314, 103.114262], 'โรงพยาบาลบรบือ'], 96: [[35, 31, 24], [21, 17, 2], [16.435133, 100.344522], 'โรงพยาบาลพิจิตร']
           , 97: [[1, 1, 0], [0, 0, 0], [15.850829, 103.57166], 'โรงพยาบาลจตุรพักตรพิมาน'], 98: [[11, 11, 7], [6, 6, 1], [10.707909, 99.318419], 'โรงพยาบาลปะทิว']
           , 99: [[39, 23, 17], [15, 10, 1], [15.167242, 102.248356], 'โรงพยาบาลโนนสูง'], 100: [[15, 14, 10], [3, 2, 1], [16.921511, 103.633323], 'โรงพยาบาลคำม่วง']
           , 101: [[5, 1, 3], [0, 0, 0], [14.585806, 100.625657], 'โรงพยาบาลดอนพุด'], 102: [[0, 0, 0], [0, 0, 0], [12.935802, 100.886612], 'โรงพยาบาลพัทยาเมโมเรียล']
           , 103: [[13, 4, 3], [6, 4, 0], [13.66455, 100.602438], 'โรงพยาบาลมโนรมย์'], 104: [[48, 43, 19], [14, 9, 0], [6.547841, 101.276454], 'โรงพยาบาลยะลา']
           , 105: [[4, 2, 2], [0, 0, 0], [13.817045, 101.305234], 'โรงพยาบาลราชสาส์น']
           , 107: [[15, 9, 8], [11, 6, 0], [13.792523, 100.194065], 'โรงพยาบาลนครชัยศรี'], 108: [[9, 6, 6], [3, 2, 2], [15.115354, 103.611665], 'โรงพยาบาลจอมพระ']
           , 111: [[5, 4, 3], [6, 3, 0], [14.498684, 100.788679], 'โรงพยาบาลหนองแซง']
           , 112: [[30, 26, 21], [15, 12, 1], [18.049639, 103.085882], 'โรงพยาบาลโพนพิสัย'], 113: [[126, 88, 53], [67, 44, 6], [12.966822, 100.905974], 'โรงพยาบาลบางละมุง']
           , 114: [[0, 0, 0], [0, 0, 0], [6.393557, 101.692961], 'โรงพยาบาลยี่งอเฉลิมพระเกียรติ'], 115: [[38, 33, 24], [33, 22, 4], [16.709779, 98.572188], 'โรงพยาบาลแม่สอด']
           , 116: [[24, 24, 16], [3, 3, 1], [18.084854, 99.846496], 'โรงพยาบาลลอง'], 117: [[0, 0, 0], [0, 0, 0], [13.576114, 100.27139], 'โรงพยาบาลศรีวิชัย5']
           , 119: [[33, 33, 10], [12, 11, 0], [8.446277, 99.532948], 'โรงพยาบาลฉวาง']
           , 122: [[20, 17, 13], [7, 7, 0], [16.134618, 102.534385], 'โรงพยาบาลมัญจาคีรี'], 123: [[27, 24, 19], [13, 11, 4], [17.849686, 103.569801], 'โรงพยาบาลบ้านม่วง']
           , 126: [[29, 17, 8], [27, 9, 0], [16.817905, 100.271653], 'โรงพยาบาลรัตนเวช2'], 127: [[2, 2, 2], [3, 3, 1], [15.650113, 103.578461], 'โรงพยาบาลเกษตรวิสัย']
           , 128: [[28, 26, 17], [13, 12, 3], [13.747839, 101.362906], 'โรงพยาบาลพนมสารคาม'], 129: [[22, 9, 14], [8, 5, 1], [17.895628, 101.662851], 'โรงพยาบาลเชียงคาน']
           , 130: [[14, 12, 13], [4, 4, 0], [15.430262, 102.338164], 'โรงพยาบาลคง'], 131: [[37, 25, 22], [7, 5, 0], [15.767944, 101.010051], 'โรงพยาบาลบึงสามพัน']
           , 132: [[6, 5, 3], [5, 3, 0], [7.423264, 100.175424], 'โรงพยาบาลบางแก้ว'], 125: [[12, 11, 6], [10, 8, 0], [7.568677, 99.693906], 'โรงพยาบาลนาโยง']
           , 124: [[38, 34, 18], [9, 8, 1], [16.107466, 102.258919], 'โรงพยาบาลแก้งคร้อ'], 121: [[18, 17, 11], [2, 1, 1], [14.924735, 104.686388], 'โรงพยาบาลโนนคูณ']
           , 120: [[2, 1, 1], [3, 3, 0], [18.702438, 101.007843], 'โรงพยาบาลแม่จริม'], 118: [[0, 0, 0], [2, 2, 0], [13.056783, 99.88414], 'โรงพยาบาลบ้านลาด']
           , 110: [[13, 8, 4], [5, 2, 2], [13.531555, 100.630882], 'โรงพยาบาลรัทรินทร์'], 109: [[14, 12, 10], [8, 7, 0], [15.211966, 100.666112], 'โรงพยาบาลหนองม่วง']
           , 106: [[5, 4, 5], [3, 3, 1], [16.35004, 100.789102], 'โรงพยาบาลวังโป่ง'], 88: [[104, 72, 49], [48, 32, 5], [16.42916, 102.848114], 'โรงพยาบาลขอนแก่น']
           , 74: [[8, 6, 3], [5, 4, 0], [13.466384, 99.943614], 'โรงพยาบาลนภาลัย'], 61: [[19, 17, 12], [4, 4, 1], [20.038552, 99.302289], 'โรงพยาบาลแม่อาย']
           , 59: [[0, 0, 0], [0, 0, 0], [8.436185, 99.963628], 'โรงพยาบาลนครคริสเตียน'], 53: [[12, 10, 8], [5, 4, 2], [15.553461, 100.066086], 'โรงพยาบาลโกรกพระ']
           , 46: [[2, 1, 1], [0, 0, 0], [16.017741, 98.866285], 'โรงพยาบาลอุ้มผาง'], 37: [[25, 20, 6], [16, 12, 3], [14.585087, 100.451927], 'โรงพยาบาลอ่างทอง']
           , 35: [[32, 21, 10], [21, 13, 5], [8.023683, 98.338841], 'โรงพยาบาลถลาง']
           , 25: [[54, 43, 15], [45, 38, 2], [13.686065, 101.073948], 'โรงพยาบาลเมืองฉะเชิงเทรา']}

def chart(name, hs):
    """13.71888 100.52578"""
    chart = multiBarChart(width=250, height=150, x_axis_format=None)
    xdata = ['จำนวนทั้งหมด', 'ไม่สวมหมวก', 'ดื่มสุรา']
    ydata1 = list_hs[hs][0]
    ydata2 = list_hs[hs][1]
    chart.add_serie(name="ชาย", y=ydata1, x=xdata)
    chart.add_serie(name="หญิง", y=ydata2, x=xdata)
    chart.buildhtml()
    file_name = name + str(hs) + ".html"
    text_file = open(file_name, "w")
    text_file.write(chart.htmlcontent)
    print(chart.htmlcontent)
    text_file.close()
    return file_name

def bulid_map_53():
    """Buile html for thailand map."""
# [ละติจูด,ลองติดจูด] และการซูมลำดับ 5
map_osm = folium.Map(location=[15.0000, 100.0000], zoom_start=7)
for number in range(1, len(list_hs)+1):
    map_osm.polygon_marker(location=list_hs[number][2], popup=list_hs[number][3]+"<iframe frameBorder='0' src='"+chart("Output", number)+"'></iframe>",
                         fill_color='#FF0000', num_sides=3, radius=10, rotation=60)
map_osm.create_map(path='thailandmap_53.html')
