"""ข้อมูลปีพุทธกาล 2552"""

import webbrowser
import folium
from nvd3 import multiBarChart

list_hs = {1: [[20, 16, 13], [8, 6, 1], [14.740879, 102.367749], 'โรงพยาบาลหนองบุนนาก'], 2: [[23, 21, 12], [12, 12, 2], [18.827182, 99.011832], 'โรงพยาบาลเชียงใหม่ราม2']\
           , 3: [[12, 4, 3], [12, 9, 1], [9.105904, 99.232069], 'โรงพยาบาลพุนพิน'], 4: [[26, 22, 11], [12, 10, 0], [13.53646, 99.965171], 'โรงพยาบาลดำเนินสะดวก']\
           , 5: [[30, 27, 4], [20, 20, 2], [14.476464, 100.534094], 'โรงพยาบาลบางปะหัน'], 6: [[10, 2, 0], [1, 1, 0], [12.674803, 101.221281], 'โรงพยาบาลกรุงเทพระยอง']\
           , 7: [[8, 7, 6], [2, 2, 1], [15.386086, 100.823465], 'โรงพยาบาลโคกเจริญ'], 8: [[28, 26, 14], [19, 18, 3], [20.134612, 99.859821], 'โรงพยาบาลแม่จัน']\
           , 9: [[5, 5, 3], [2, 2, 0], [13.695215, 101.051644], 'โรงพยาบาลโสธรเวช304'], 10: [[9, 8, 8], [2, 2, 0], [14.556089, 102.60047], 'โรงพยาบาลโนนสุวรรณ']\
           , 11: [[0, 0, 0], [0, 0, 0], [7.000605, 100.480464], 'โรงพยาบาลราษฏร์ยินดี'], 12: [[21, 15, 12], [12, 10, 1], [13.744615, 100.21316], 'โรงพยาบาลสามพราน']\
           , 13: [[53, 14, 22], [24, 5, 3], [13.780047, 100.509071], 'โรงพยาบาลวชิรพยาบาล'], 14: [[14, 4, 2], [7, 5, 0], [13.825600, 100.657523], 'โรงพยาบาลศรีสยาม']\
           , 15: [[34, 13, 6], [25, 15, 2], [12.953654, 100.906021], 'โรงพยาบาลกรุงเทพพัทยา'], 16: [[14, 12, 9], [4, 3, 0], [17.446002, 100.143166], 'โรงพยาบาลตรอน']\
           , 17: [[1, 1, 1], [0, 0, 0], [17.913842, 102.170742], 'โรงพยาบาลนายูง'], 18: [[12, 12, 9], [12, 11, 0], [15.210446, 103.754882], 'โรงพยาบาลสนม']\
           , 19: [[5, 5, 3], [1, 1, 0], [8.685997, 98.397388], 'โรงพยาบาลกะปง'], 20: [[0, 0, 0], [0, 0, 0], [13.731443, 100.536586], 'โรงพยาบาลจุฬาลงกรณ์']\
           , 21: [[0, 0, 0], [0, 0, 0], [12.775599, 101.716187], 'โรงพยาบาลวโรทัย']\
           , 22: [[16, 14, 5], [8, 3, 1], [15.736519, 101.773483], 'โรงพยาบาลหนองบัวระเหว'], 23: [[8, 6, 3], [2, 2, 0], [14.771259, 99.90878], 'โรงพยาบาลหนองหญ้าไซ']\
           , 24: [[6, 6, 3], [0, 0, 0], [14.564876, 102.932022], 'โรงพยาบาลเฉลิมพระเกียรติ'], 25: [[36, 24, 14], [31, 22, 6], [14.8966, 100.39767], 'โรงพยาบาลสิงห์บุรี']\
           , 26: [[1, 1, 1], [3, 1, 0], [16.531359, 104.732166], 'โรงพยาบาลมุกดาหารอินเตอร์เนชั่นแนล'], 27: [[18, 9, 5], [17, 12, 2], [14.988101, 100.334858], 'โรงพยาบาลอินทร์บุรี']\
           , 28: [[7, 4, 4], [2, 2, 0], [5.942766, 101.777372], 'โรงพยาบาลสุคิริน'], 29: [[56, 44, 31], [36, 27, 7], [18.789589, 98.97421], 'โรงพยาบาลมหาราชนครเชียงใหม่']\
           , 30: [[18, 10, 8], [17, 14, 1], [13.846362, 100.562252], 'โรงพยาบาลวิภาวดี'], 31: [[0, 0, 0], [2, 2, 0], [6.837571, 101.173529], 'โรงพยาบาลหนองจิก']\
           , 32: [[21, 16, 9], [18, 14, 0], [13.556849, 100.272005], 'โรงพยาบาลมหาชัย'], 33: [[2, 2, 1], [3, 2, 0], [16.808005, 100.259847], 'โรงพยาบาลพิษณุเวช']\
           , 34: [[13, 13, 9], [5, 5, 0], [8.062138, 99.302128], 'โรงพยาบาลลำทับ'], 35: [[9, 7, 5], [2, 1, 0], [13.881683, 101.407294], 'โรงพยาบาลศรีมโหสถ']\
           , 36: [[7, 5, 2], [3, 3, 1], [14.125793, 101.007294], 'โรงพยาบาลองค์รักษ์'], 37: [[2, 1, 0], [0, 0, 0], [9.151206, 99.141203], 'โรงพยาบาลกองบิน7']\
           , 38: [[30, 23, 16], [7, 7, 2], [16.059608, 99.861274], 'โรงพยาบาลขาณุวรลักษบุรี'], 39: [[10, 10, 6], [1, 1, 0], [7.234544, 100.529868], 'โรงพยาบาลสิงหนคร']\
           , 40: [[0, 0, 0], [0, 0, 0], [13.714295, 100.489711], 'โรงพยาบาลกรุงธน'], 41: [[19, 13, 8], [11, 6, 0], [19.87849, 99.835631], 'โรงพยาบาลเกษมราษฎร์ศรีบุรินทร์']\
           , 42: [[12, 8, 7], [4, 1, 0], [13.771762, 100.636728], 'โรงพยาบาลเวชธานี'], 43: [[29, 23, 12], [17, 15, 1], [15.570596, 101.854476], 'โรงพยาบาลจัตุรัส']\
           , 44: [[29, 24, 12], [10, 6, 1], [6.869939, 101.24873], 'โรงพยาบาลปัตตานี'], 45: [[9, 9, 8], [1, 1, 0], [17.786885, 104.088492], 'โรงพยาบาลนาทม']\
           , 46: [[20, 15, 9], [9, 7, 1], [19.335605, 100.134544], 'โรงพยาบาลจุน'], 47: [[0, 0, 0], [2, 2, 0], [13.082927, 99.945472], 'โรงพยาบาลเมืองเพชร-ธนบุรี']\
           , 48: [[26, 17, 8], [12, 11, 1], [15.544249, 103.027002], 'โรงพยาบาลพุทไธสง'], 49: [[7, 6, 4], [2, 2, 2], [14.814127, 102.166958], 'โรงพยาบาลพนมไพร']\
           , 50: [[25, 18, 16], [12, 8, 1], [15.115354, 103.611665], 'โรงพยาบาลจอมพระ'], 51: [[0, 0, 0], [0, 0, 0], [13.757634, 100.519365], 'โรงพยาบาลมิชชั่น']\
           , 52: [[11, 9, 8], [3, 2, 1], [15.193713, 104.837939], 'โรงพยาบาลวารินชำราบ'], 53: [[1, 1, 0], [0, 0, 0], [17.712, 102.208861], 'โรงพยาบาลน้ำโสม']\
           , 54: [[6, 5, 2], [7, 6, 0], [15.19434, 100.842303], 'โรงพยาบาลสระโบสถ์'], 55: [[13, 13, 11], [9, 7, 1], [16.655866, 103.911527], 'โรงพยาบาลห้วยผึ้ง']\
           , 56: [[68, 51, 25], [21, 17, 3], [14.534011, 100.915405], 'โรงพยาบาลสระบุรี'], 57: [[1, 1, 0], [0, 0, 0], [13.056783, 99.88414], 'โรงพยาบาลบ้านลาด']\
           , 58: [[26, 16, 12], [27, 23, 0], [7.614499, 100.074014], 'โรงพยาบาลพัทลุง'], 59: [[4, 3, 3], [2, 2, 2], [19.507776, 99.990591], 'โรงพยาบาลป่าแดด']\
           , 60: [[1, 0, 0], [2, 1, 0], [13.362618, 100.986131], 'โรงพยาบาลชลเวช'], 61: [[7, 5, 2], [2, 2, 1], [6.250866, 102.046226], 'โรงพยาบาลตากใบ']\
           , 62: [[46, 28, 13], [34, 21, 0], [13.908165, 99.76726], 'โรงพยาบาลมะการักษ์'], 63: [[5, 5, 2], [9, 9, 0], [16.598556, 99.845234], 'โรงพยาบาลลานกระบือ']\
           , 64: [[22, 12, 6], [10, 6, 0], [13.59518, 100.600984], 'โรงพยาบาลเมืองสมทรปากน้ำ'], 65: [[0, 0, 0], [1, 1, 0], [13.636475, 100.610047], 'โรงพยาบาลจุฬารัตน์2']\
           , 66: [[24, 21, 15], [8, 6, 0], [14.621473, 104.422987], 'โรงพยาบาลขุนหาญ'], 67: [[39, 34, 28], [15, 10, 0], [15.78143, 104.161409], 'โรงพยาบาลยโสธร']\
           , 68: [[11, 10, 8], [2, 2, 1], [12.770828, 102.033594], 'โรงพยาบาลเขาสุกิม'], 69: [[13, 11, 5], [9, 8, 0], [7.952302, 99.143714], 'โรงพยาบาลคลองท่อม']\
           , 70: [[13, 13, 10], [6, 6, 5], [9.535357, 100.042467], 'โรงพยาบาลไทยอินเตอร์'], 71: [[45, 44, 29], [21, 19, 5], [18.133833, 100.153768], 'โรงพยาบาลแพร่']\
           , 72: [[20, 11, 10], [10, 9, 0], [15.379931, 100.019926], 'โรงพยาบาลอุทัยธานี'], 73: [[31, 12, 9], [8, 3, 1], [13.694222, 100.494226], 'โรงพยาบาลเจริญกรุงประชารักษ์']\
           , 74: [[6, 4, 4], [2, 0, 0], [19.300411, 100.716522], 'โรงพยาบาลสองแคว'], 75: [[75, 64, 53], [24, 15, 1], [14.876487, 103.502469], 'โรงพยาบาลสุรินทร์']\
           , 76: [[0, 0, 0], [0, 0, 0], [13.681595, 100.474673], 'โรงพยาบาลบางประกอก'], 77: [[0, 0, 0], [0, 0, 0], [13.798001, 100.476463], 'โรงพยาบาลอนันต์พัฒนา']\
           , 78: [[1, 1, 0], [3, 2, 0], [8.386944, 99.978655], 'โรงพยาบาลนครภัฒณ์'], 79: [[10, 10, 4], [5, 5, 0], [9.736091, 99.991109], 'โรงพยาบาลเกาะพงัน']\
           , 80: [[8, 7, 5], [0, 0, 0], [17.270706, 102.597954], 'โรงพยาบาลหนองวัวซอ'], 81: [[24, 19, 17], [8, 4, 3], [12.904866, 102.263152], 'โรงพยาบาลโป่งน้ำร้อน']\
           , 82: [[3, 3, 3], [1, 1, 0], [7.456774, 100.13679], 'โรงพยาบาลเขาชัยสน'], 83: [[20, 18, 16], [5, 5, 2], [16.649886, 103.296465], 'โรงพยาบาลหนองกุงศรี']\
           , 84: [[21, 16, 5], [7, 5, 0], [15.044046, 100.54195], 'โรงพยาบาลบ้านหมี่'], 85: [[63, 59, 30], [28, 27, 3], [16.872799, 99.131606], 'โรงพยาบาลสมเด็จพระเจ้าตากสินมหาราช']\
           , 86: [[27, 24, 14], [14, 11, 3], [12.778546, 101.292532], 'โรงพยาบาลบ้านค่าย'], 87: [[2, 2, 1], [2, 2, 0], [16.784401, 101.240739], 'โรงพยาบาลนครหล่ม']\
           , 88: [[10, 10, 10], [2, 1, 2], [17.164862, 102.780086], 'โรงพยาบาลหนองแสง'], 89: [[2, 2, 1], [1, 0, 0], [13.880613, 100.578325], 'โรงพยาบาลจุฬาภรณ์']\
           , 90: [[19, 13, 8], [5, 4, 0], [12.041384, 99.853837], 'โรงพยาบาลกุยบุรี'], 91: [[5, 2, 2], [2, 0, 0], [17.444957, 99.158102], 'โรงพยาบาลแม่พริก']\
           , 92: [[0, 0, 0], [0, 0, 0], [13.724758, 100.465162], 'โรงพยาบาลบางไผ่'], 93: [[7, 6, 6], [1, 1, 0], [13.601492, 101.086683], 'โรงพยาบาลบ้านโพธิ์']\
           , 94: [[0, 0, 0], [0, 0, 0], [13.707272, 100.289484], 'โรงพยาบาลศรีวิชัย3'], 95: [[5, 4, 0], [1, 1, 0], [9.130859, 99.362179], 'โรงพยาบาลค่ายวิภาวดีรังสิต']\
           , 96: [[6, 5, 5], [2, 2, 0], [7.258853, 100.176582], 'โรงพยาบาลป่าบอน'], 97: [[8, 7, 4], [3, 3, 0], [15.948597, 104.198502], 'โรงพยาบาลทรายมูล']\
           , 98: [[9, 7, 6], [2, 2, 0], [18.087307, 99.265943], 'โรงพยาบาลเสริมงาม'], 99: [[47, 38, 16], [14, 13, 0], [8.162159, 99.680263], 'โรงพยาบาลทุ่งสง']\
           , 100: [[78, 58, 36], [44, 28, 5], [12.603376, 102.1013], 'โรงพยาบาลพระปกเกล้า']}
           
def chart(name, hs):
    """13.71888 100.52578"""
    chart = multiBarChart(width=250, height=150, x_axis_format=None)
    xdata = ['จำนวนทั้งหมด', 'ไม่สวมหมวก', 'ดื่มสุรา']
    ydata1 = list_hs[hs][0]
    ydata2 = list_hs[hs][1]
    chart.add_serie(name="ชาย", y=ydata1, x=xdata)
    chart.add_serie(name="หญิง", y=ydata2, x=xdata)
    chart.buildhtml()
    file_name = name + str(hs) + ".html"
    text_file = open(file_name, "w")
    text_file.write(chart.htmlcontent)
    print(chart.htmlcontent)
    text_file.close()
    return file_name

def bulid_map_52():
    """Buile html for thailand map."""
# [ละติจูด,ลองติดจูด] และการซูมลำดับ 5
map_osm = folium.Map(location=[15.0000, 100.0000], zoom_start=7)
for number in range(1, len(list_hs)+1):
    map_osm.polygon_marker(location=list_hs[number][2], popup=list_hs[number][3]+"<iframe frameBorder='0' src='"+chart("Output", number)+"'></iframe>",
                         fill_color='#FF0000', num_sides=3, radius=10, rotation=60)
map_osm.create_map(path='thailandmap_52.html')
