"""ข้อมูลปีพุทธกาล 2558"""

import webbrowser
import folium
from nvd3 import multiBarChart

list_hs = {1: [[9, 8, 2], [6, 6, 0], [8.83483, 99.16015], 'โรงพยาบาลเคียนซา']\
, 3: [[4, 2, 1], [2, 1, 0], [8.4980253, 99.9524173], 'โรงพยาบาลค่ายวชิราวุธ']\
, 4: [[18, 18, 3], [10, 10, 0], [14.7388, 103.6552], 'โรงพยาบาลลำดวน']\
, 5: [[20, 14, 2], [24, 15, 1], [13.5568, 100.2718], 'โรงพยาบาลมหาชัย']\
, 6: [[50, 31, 21], [27, 16, 5], [14.6319, 103.4111], 'โรงพยาบาลปราสาท']\
, 7: [[12, 9, 6], [2, 2, 0], [15.6976, 104.6419], 'โรงพยาบาลลืออำนาจ']\
, 8: [[22, 18, 5], [10, 6, 0], [8.1746, 99.8620], 'โรงพยาบาลร่อนพิบูลย์']\
, 9: [[28, 25, 20], [12, 8, 1], [16.6499, 103.2966], 'โรงพยาบาลหนองกุงศรี']\
, 10: [[20, 17, 6], [10, 8, 1], [13.7917, 100.1957], 'โรงพยาบาลนครชัยศรี']\
, 11: [[2, 2, 1], [4, 2, 2], [13.63370, 100.71013], 'โรงพยาบาลจุฬารัตน์']\
, 13: [[18, 14, 10], [7, 4, 0], [7.2595, 100.1767], 'โรงพยาบาลป่าบอน']\
, 14: [[7, 7, 4], [2, 0, 0], [18.8948, 100.2939], 'โรงพยาบาลเชียงม่วน']\
, 15: [[15, 9, 5], [7, 3, 1], [18.0896, 99.8439], 'โรงพยาบาลลอง']\
, 16: [[10, 7, 2], [11, 7, 1], [14.9886, 100.3346], 'โรงพยาบาลอินทร์บุรี']\
, 17: [[9, 9, 2], [6, 5, 1], [7.8401668, 99.9401359], 'โรงพยาบาลป่าพะยอม']\
, 18: [[16, 16, 13], [8, 6, 1], [17.0348, 100.2013], 'โรงพยาบาลพรหมพิราม']\
, 19: [[25, 17, 14], [10, 9, 1], [13.8168, 102.0726], 'โรงพยาบาลสมเด็จพระยุพราชสระแก้ว']\
, 20: [[5, 5, 4], [4, 4, 0], [7.7169, 99.8787], 'โรงพยาบาลศรีบรรพต']\
, 21: [[8, 5, 3], [9, 7, 0], [13.2821, 101.4200], 'โรงพยาบาลบ่อทอง']\
, 22: [[17, 16, 10], [6, 5, 0], [15.6327, 103.3428], 'โรงพยาบาลปทุมรัตต์']\
, 23: [[2, 2, 0], [2, 2, 0], [8.5010, 98.6290], 'โรงพยาบาลทับปุด']\
, 24: [[7, 5, 1], [5, 3, 0], [8.4168462, 99.9630105], 'โรงพยาบาลเทศบาลนครศรีธรรมราช']\
, 25: [[17, 10, 2], [13, 7, 1], [18.2824, 99.4854], 'โรงพยาบาลเขลางค์นคร']\
, 26: [[18, 13, 11], [3, 3, 0], [15.7815102, 99.5189613], 'โรงพยาบาลแม่วงก์']\
, 27: [[26, 19, 16], [9, 5, 1], [15.7575383, 99.8135516], 'โรงพยาบาลลาดยาว']\
, 28: [[8, 6, 3], [3, 3, 0], [14.4465, 100.3731], 'โรงพยาบาลผักไห่']\
, 29: [[12, 7, 6], [5, 2, 0], [13.650496, 100.5918503], 'โรงพยาบาลสำโรงการแพทย์']\
, 30: [[17, 15, 3], [6, 6, 0], [9.5974, 99.1659], 'โรงพยาบาลท่าชนะ']\
, 31: [[1, 0, 0], [0, 0, 0], [12.4098953, 99.9215014], 'โรงพยาบาลค่ายธนะรัตน์']\
, 32: [[4, 4, 3], [6, 4, 0], [16.8000671, 104.5280083], 'โรงพยาบาลดงหลวง']\
, 33: [[16, 11, 9], [15, 11, 0], [17.6368, 99.2404], 'โรงพยาบาลเถิน']\
, 34: [[45, 36, 17], [31, 23, 3], [13.4064, 99.9980], 'โรงพยาบาลสมเด็จพระพุทธเลิศหล้า']\
, 35: [[21, 19, 10], [7, 6, 0], [16.1589271, 100.6016093], 'โรงพยาบาลทับคล้อ']\
, 36: [[12, 8, 8], [10, 6, 0], [15.2988111, 101.9816919], 'โรงพยาบาลพระทองคำ']\
, 37: [[4, 3, 0], [4, 0, 0], [8.4488, 98.5263], 'โรงพยาบาลพังงา']\
, 38: [[1, 1, 1], [1, 1, 0], [16.0010937, 100.5872895], 'โรงพยาบาลดงเจริญ']\
, 39: [[11, 10, 11], [5, 4, 0], [18.1573101, 99.5374373], 'โรงพยาบาลแม่ทะ']\
, 40: [[5, 4, 2], [11, 6, 3], [13.648878, 100.5676927], 'โรงพยาบาลชัยปราการ']\
, 41: [[14, 9, 3], [9, 4, 0], [12.5983, 102.1215], 'โรงพยาบาลสิริเวช']\
, 42: [[11, 9, 8], [8, 7, 0], [16.8278766,99.7925218], 'โรงพยาบาลคีรีมาศ']\
, 43: [[30, 29, 14], [10, 10, 3], [16.7972, 102.1879], 'โรงพยาบาลสีชมพู']\
, 44: [[97, 84, 21], [48, 39, 1], [7.5686, 99.6191], 'โรงพยาบาลตรัง']\
, 46: [[8, 8, 4], [5, 5, 0], [16.5765, 103.7871], 'โรงพยาบาลนามน']\
, 47: [[28, 23, 13], [13, 11, 0], [14.0076995,99.9734419], 'โรงพยาบาลกำแพงแสน']\
, 48: [[23, 20, 3], [6, 6, 0], [9.7575, 99.0862], 'โรงพยาบาลละแม']\
, 49: [[8, 6, 1], [5, 5, 0], [17.2215, 104.2881], 'โรงพยาบาลโพนนาแก้ว']\
, 50: [[5, 4, 1], [6, 2, 0], [8.4565, 99.9675], 'โรงพยาบาลนครินทร์']\
, 51: [[10, 5, 2], [2, 1, 0], [14.1117941,100.9824765], 'โรงพยาบาลศูนย์การแพทย์สมเด็จพระเทพรัตนราชสุดา']\
, 52: [[78, 60, 37], [35, 25, 2], [14.6798469,101.3983742], 'โรงพยาบาลปากช่องนานา']\
, 53: [[49, 46, 24], [31, 29, 1], [13.5309, 99.8179], 'โรงพยาบาลราชบุรี']\
, 54: [[23, 22, 18], [3, 3, 0], [16.6521, 102.3798], 'โรงพยาบาลภูเวียง']\
, 55: [[30, 25, 17], [15, 13, 2], [16.4351533,100.3424727], 'โรงพยาบาลพิจิตร']\
, 56: [[48, 43, 13], [37, 30, 3], [8.0755, 98.9151], 'โรงพยาบาลกระบี่']\
, 57: [[34, 33, 8], [30, 21, 1], [12.9665, 99.8907], 'โรงพยาบาลท่ายาง']\
, 58: [[11, 8, 4], [4, 2, 0], [13.5838302,100.8523451], 'โรงพยาบาลรวมชัยประชารักษ์']\
, 59: [[0, 0, 0], [1, 1, 0], [13.7156007,100.5883886], 'โรงพยาบาลร้านหมอสวนิตย์']\
, 60: [[67, 56, 19], [42, 35, 2], [12.6073, 99.9474], 'โรงพยาบาลหัวหิน']\
, 61: [[5, 3, 1], [2, 2, 0], [9.1912, 98.4155], 'โรงพยาบาลคุระบุรี']\
, 62: [[41, 33, 13], [26, 18, 1], [14.0053444,99.5437074], 'โรงพยาบาลพหลพลพยุหเสนา']\
, 63: [[19, 15, 5], [6, 2, 0], [15.3917568,99.8490369], 'โรงพยาบาลหนองฉาง']\
, 64: [[5, 4, 3], [6, 6, 0], [15.345182,102.9120613], 'โรงพยาบาลสำทะเมนชัย']\
, 65: [[24, 17, 7], [15, 13, 1], [13.5911, 100.1047], 'โรงพยาบาลบ้านแพ้ว']\
, 66: [[60, 46, 24], [38, 27, 2], [15.7069998, 100.1384386], 'โรงพยาบาลสวรรค์ประชารักษ์']\
, 67: [[11, 11, 4], [1, 1, 0], [16.6456, 101.9036], 'โรงพยาบาลภูผาม่าน']\
, 68: [[6, 3, 4], [1, 1, 1], [16.0380, 105.2124], 'โรงพยาบาลเขมราฐ']\
, 69: [[2, 2, 1], [0, 0, 0], [6.43036,101.0189123], 'โรงพยาบาลกาบัง']\
, 71: [[12, 7, 2], [11, 7, 0], [14.718258,101.4294663], 'โรงพยาบาลกรุงเทพปากช่อง']\
, 72: [[9, 9, 5], [8, 6, 0], [17.7949, 100.3775], 'โรงพยาบาลท่าปลา']\
, 73: [[10, 7, 10], [0, 0, 0], [16.0694, 104.4331], 'โรงพยาบาลไทยเจริญ']\
, 74: [[23, 21, 15], [9, 8, 5], [16.3501, 100.7900], 'โรงพยาบาลวังโป่ง']\
, 75: [[12, 11, 5], [2, 2, 1], [18.6164, 98.7744], 'โรงพยาบาลแม่วาง']\
, 76: [[38, 24, 19], [12, 4, 1], [15.94722,99.9778473], 'โรงพยาบาลบรรพตพิสัย']\
, 77: [[33, 19, 12], [22, 14, 4], [12.6825632,101.2747694], 'โรงพยาบาลระนอง']\
, 78: [[5, 4, 2], [1, 1, 0], [13.4559, 99.8848], 'โรงพยาบาลวัดเพลง']\
, 79: [[3, 3, 0], [4, 4, 0], [6.2227, 101.8084], 'โรงพยาบาลเจาะไอร้อง']\
, 80: [[1, 0, 1], [0, 0, 0], [18.2117, 100.6624], 'โรงพยาบาลนาหมื่น']\
, 2: [[14, 12, 2], [9, 6, 0], [9.1053, 99.2325], 'โรงพยาบาลพุนพิน']\
, 12: [[29, 18, 15], [16, 12, 0], [14.733724,102.1545273], 'โรงพยาบาลโชคชัย']\
, 45: [[0, 0, 0], [0, 0, 0], [7.000604,100.4783103], 'โรงพยาบาลราษฏร์ยินดี']\
, 70: [[8, 6, 2], [7, 5, 2], [13.1570, 101.3635], 'โรงพยาบาลหนองใหญ่']}

def chart(name, hs):
    """13.71888 100.52578"""
    chart = multiBarChart(width=250, height=150, x_axis_format=None)
    xdata = ['จำนวนทั้งหมด', 'ไม่สวมหมวก', 'ดื่มสุรา']
    ydata1 = list_hs[hs][0]
    ydata2 = list_hs[hs][1]
    chart.add_serie(name="ชาย", y=ydata1, x=xdata)
    chart.add_serie(name="หญิง", y=ydata2, x=xdata)
    chart.buildhtml()
    file_name = name + str(hs) + ".html"
    text_file = open(file_name, "w")
    text_file.write(chart.htmlcontent)
    print(chart.htmlcontent)
    text_file.close()
    return file_name

def bulid_map_58():
    """Buile html for thailand map."""
# [ละติจูด,ลองติดจูด] และการซูมลำดับ 5
map_osm = folium.Map(location=[15.0000, 100.0000], zoom_start=7)
for number in range(1, len(list_hs)+1):
    map_osm.polygon_marker(location=list_hs[number][2], popup=list_hs[number][3]+"<iframe frameBorder='0' src='"+chart("Output", number)+"'></iframe>",
                         fill_color='#FF0000', num_sides=3, radius=10, rotation=60)
map_osm.create_map(path='thailandmap_58.html')
